clear, clc
% 纵向长度
if ~exist('Pics', 'dir')
    mkdir("Pics");
end
dl = 4.914e-2;
x_velo = dl./([170.6 170.7 171.0 171.1 172.2 173.5 174.1 174.7;
    126.1 126.6 128.6 129.2 130.2 131.7 133.1 134.1;
    149.0 150.1 153.1 155.2 157.7 161.1 164.2 166.2;
    98.6 99.7 102.1 103.1 104.7 106.6 108.2 109.6;
    121.1 123.0 126.1 128.6 131.7 135.1 139.0 142.7;
    125.2 128.2 132.7 135.7 139.7 144.6 149.6 154.6;
    123.6 127.2 132.6 136.5 141.2 146.7 153.7 159.6;
    161.7 167.7 176.7 185.7 196.2 207.2 219.1 229.6]/1000);
X_tick = [0 418 879 1294 1722 2153 2631 3089;
    0 310 656 969 1294 1623 19987 2338;
    0 367 776 1149 2386 1938 2386 2820;
    0 243 516 764 1024 1288 1583 1869;
    0 299 635 944 1268 1601 1978 2347;
    0 310 661 986 1329 1683 2087 2485;
    0 307 656 982 1327 1686 2097 2506;
    0 402 865 1302 1775 2275 2857 3442]/1000;

l = 8;
% f = fit(x_per(l, :)', X_tick(l, :)', 'poly1');
% hold on
% scatter(x_per(l, :)', X_tick(l, :)')
% plot(x_per(l, :)', f(x_per(l, :)))
% f.p1
pp = zeros(1, l);
x_velo = log(x_velo);
for i = 1:l
    f = fit(x_velo(i, :)', X_tick(i, :)', 'poly1');
    pp(i) = f.p1;
end
pp(1) = -32.6875;
pp(2) = -23;
f2 = fit((3:8)', pp(3:8)', 'poly1');
hold on
grid on
box on
t1 = ['$\Delta k = ' num2str(f2.p1) '$'];
t2 = ['$w_0 = ' num2str(f2.p2) '$'];
scatter(1:8, pp)
plot(1:l, f2(1:l))
text(5.5, -20, t1, 'Interpreter','latex', 'FontSize',15)
text(5.5, -22, t2, 'Interpreter','latex', 'FontSize',15)
xlabel('$w_i$', 'Interpreter','latex')
ylabel('k')
title("vertical")
legend('data', 'fit')
saveas(gca, 'Pics\vertical', 'jpeg')
